fix SPEC.md和SPEC_PROCESS.md
